{
    "1": {
        "title": "Existing Convolution + Auto/Cross Correlation Visualisations",
        "description": "Existing Convolution + Auto/Cross Correlation Visualisations",
        "date": "Nov 20 2018",
        "body": "**Wikipedia**\n\nAs always the first place to look for explanations is wikipedia. Wiki page for Convolution contains enough information to understand both mathematically and visually. You can go right to visual explanation [here](https://en.wikipedia.org/wiki/Convolution#Visual_explanation), which I like a lot. In my tool, same mechanic could be implemented where one signal slides past other and draws the shape of result of convolution.\nSimilar thing can be found on cross-correlation [wiki](https://en.wikipedia.org/wiki/Cross-correlation) and auto-correlation [wiki](https://en.wikipedia.org/wiki/Autocorrelation), but both show much less visual presentations.\n\n**Visualization of Cross Correlation and Convolution with Matlab**\n- very good visualisation of cross-correlation / convolution, but no narrative\n- can be found [here](https://youtu.be/O9-HN-yzsFQ)\n\n**Graphical convolution example**\n- In depth explanation, but slightly confusing / not very easy to understand from first try.\n- Still makes sense if more time is spent on it.\n- Defeats the purpose a little bit if person has to watch it more than once\n- can be found [here](https://youtu.be/zoRJZDiPGds)\n\n**Understanding Convolutions**\n- oriented towards understanding of convolutional neural networks\n- another in-depth explanation\n- explains two-dimensional convolution too\n- can be found [here](http://colah.github.io/posts/2014-07-Understanding-Convolutions/)\n\n**Autocorrelation Plot**\n- explains everything in plain text without visual part\n- can be found [here](https://www.itl.nist.gov/div898/handbook/eda/section3/autocopl.htm)\n\n**Summary**\n\nOf all visualisations, the wikipedia Convolution explanation and first two visualisations after wikipedia part show how it works the best. I'd suggest using similar approach with horizontally sliding signals, but I'd add a possibility to use mouse/finger to slide back and forth to show which point is being calculated. People tend to understand things better when they touch them."
    }
}